In [1]:
print('hello world ')

hello world

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":['harry','rohan','shawon'],
    "marks":[92,34,24],
    "city":['rampur','kolkata','new york',]
}

In [4]:
df=pd.DataFrame(dict1)
#its use to basically analyze big data 
#it covert in data frame in

In [5]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     34   kolkata
2  shawon     24  new york

In [6]:
###covert in csv this data frame

In [7]:
df.to_csv('friends.csv')
#it create a excel shit in this data frame which is given on the index
#with index and column give it 
#it also include index

In [8]:
#we can see without index
df.to_csv('friends_index_false.csv',index=False)

In [9]:
#if the data is so big 
#if we want to see only first 2 row 
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [10]:
#if we want to see 2nd two row
df.tail(2)

     name  marks      city
1   rohan     34   kolkata
2  shawon     24  new york

In [ ]:
df.describe()#details tells us about this csv

          marks
count   3.00000
mean   50.00000
std    36.71512
min    24.00000
25%    29.00000
50%    34.00000
75%    63.00000
max    92.00000

In [ ]:
arman=pd.read_csv('arman.csv')#creat a new csv file which is read in 
#this method
arman

   Unnamed: 0   location     city     country
0           0    gazipur    Dhaka  Bangladesh
1           1  newmarket  nilkhet       dhaka
2           2     uttara  azompur       dhaka

In [22]:
arman['location']#we only see the location

0      gazipur
1    newmarket
2       uttara
Name: location, dtype: object

In [23]:
#change specific  value in this 
arman['city'][0]='usa'
arman

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15552\2052056910.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  arman['city'][0]='usa'
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15552\2052056910.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  arman['city'][0]='usa'

   Unnamed: 0   location     city     country
0           0    gazipur      usa  Bangladesh
1           1  newmarket  nilkhet       dhaka
2           2     uttara  azompur       dhaka

In [25]:
#in this above code 0 index we change the city name 
#Dhaka to usa we want to save this modify in arman.csv file 
arman.to_csv('arman.csv')

In [ ]:
#series and dataframe
ser=pd.Series(np.random.rand(34))
#it gives us a series 0 to 34

In [31]:
ser

0     0.066683
1     0.741140
2     0.440712
3     0.212957
4     0.260631
5     0.759343
6     0.937209
7     0.262909
8     0.927862
9     0.877385
10    0.593151
11    0.572348
12    0.329603
13    0.978687
14    0.730642
15    0.534890
16    0.024995
17    0.789259
18    0.647249
19    0.955493
20    0.587553
21    0.741560
22    0.514230
23    0.981285
24    0.036875
25    0.309264
26    0.988069
27    0.843761
28    0.919918
29    0.961953
30    0.542067
31    0.250980
32    0.395966
33    0.572670
dtype: float64

In [33]:
type(ser)#its a series 
#its a data structure in pandas

pandas.core.series.Series

In [35]:
#create a dataframe 
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))
newdf.head()
#without head()it print all dataframe which has 334 rows and 5 column
newdf

            0         1         2         3         4
0    0.431045  0.977113  0.618346  0.280718  0.795835
1    0.150578  0.150138  0.704924  0.530115  0.174036
2    0.802114  0.893402  0.602193  0.891469  0.283796
3    0.130650  0.716312  0.796403  0.105497  0.713780
4    0.023335  0.975231  0.572050  0.442337  0.712340
..        ...       ...       ...       ...       ...
329  0.085289  0.846622  0.573262  0.507820  0.568131
330  0.369228  0.172142  0.806732  0.922176  0.545956
331  0.331504  0.241101  0.581982  0.192399  0.711254
332  0.504943  0.050377  0.479013  0.044331  0.659212
333  0.755485  0.796496  0.846857  0.785051  0.492749

[334 rows x 5 columns]

In [36]:
type(newdf)

pandas.core.frame.DataFrame

In [37]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.495642    0.472705    0.478670    0.478566    0.471093
std      0.287472    0.278062    0.290120    0.296357    0.284162
min      0.000378    0.003741    0.000094    0.006666    0.001970
25%      0.253431    0.236282    0.239828    0.222948    0.222752
50%      0.485639    0.456151    0.447201    0.469818    0.464851
75%      0.752068    0.698928    0.729373    0.737440    0.712069
max      0.997177    0.999262    0.993653    0.996797    0.999369

In [38]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [39]:
newdf.head()

          0         1         2         3         4
0  0.431045  0.977113  0.618346  0.280718  0.795835
1  0.150578  0.150138  0.704924  0.530115  0.174036
2  0.802114  0.893402  0.602193  0.891469  0.283796
3  0.130650  0.716312  0.796403  0.105497  0.713780
4  0.023335  0.975231  0.572050  0.442337  0.712340